[
  {
    "title": "SoK: Analysis Techniques for WebAssembly",
    "journal": "MDPI Future Internet",
    "date": "2024",
    "doi": "https://doi.org/10.3390/fi16030084",
    "abstract": "WebAssembly is a low-level bytecode language that enables high-level languages like C, C++, and Rust to be executed in the browser at near-native performance. In recent years, WebAssembly has gained widespread adoption and is now natively supported by all modern browsers. Despite its benefits, WebAssembly has introduced significant security challenges, primarily due to vulnerabilities inherited from memory-unsafe source languages. Moreover, the use of WebAssembly extends beyond traditional web applications to smart contracts on blockchain platforms, where vulnerabilities have led to significant financial losses. WebAssembly has also been used for malicious purposes, like cryptojacking, where website visitors' hardware resources are used for crypto mining without their consent. To address these issues, several analysis techniques for WebAssembly binaries have been proposed. This paper presents a systematic review of these analysis techniques, focusing on vulnerability analysis, cryptojacking detection, and smart contract security. The analysis techniques are categorized into static, dynamic, and hybrid methods, evaluating their strengths and weaknesses based on quantitative data. Our findings reveal that static techniques are efficient but may struggle with complex binaries, while dynamic techniques offer better detection at the cost of increased overhead. Hybrid approaches, which merge the strengths of static and dynamic methods, are not extensively used in the literature and emerge as a promising direction for future research. Lastly, this paper identifies potential future research directions based on the state of the current literature.",
    "keywords": [
      "WebAssembly",
      "Vulnerability analysis",
      "Browser security",
      "Cryptojacking",
      "Smart contracts"
    ]
  },
  {
    "title": "Deceptive Bytes: WebAssembly Obfuscation for Evading Crypto Mining Detection",
    "journal": "To be announced.",
    "date": "2024",
    "doi": "",
    "abstract": "To be published.",
    "keywords": [
      "WebAssembly",
      "Obfuscation",
      "Browser security",
      "Crypto mining"
    ]
  }
]
